%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                                                                                                                                                                              % 
%             主要功能 : VRP标准测试算例生成ICT算例                                                                                                     %  
%                                                                                                                                                                              % 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

clc
clear all
close all

%----------------------------------------------------------------------------------------------------------------------------%
%   -- 输入VRP算例
%----------------------------------------------------------------------------------------------------------------------------%

%%%%%%%%%%%%%%%%%%
%   - 导入原始VRP标准测试算例    %
%%%%%%%%%%%%%%%%%%

%------------------------------------------------------------------------%
%       - Solomon标准测试算例说明
%           - 客户规模 : 100
%           - 最大车辆数 : 12
%           - 最大车容量 : 200
%           - 行指标 : 
%               - 第 1 行 : 车辆中心信息(编号为0)
%               - 第 2 ~ 101 行 : 客户节点信息
%           - 列指标 : 
%               - 第一列 : 节点编号(CUST NO.)
%               - 第二列 : 横坐标(XCOORD)
%               - 第三列 : 纵坐标(YCOORD)
%               - 第四列 : 客户需求(DEMAND)
%               - 第五列 : 开始时间窗(READY_TIME)
%               - 第六列 : 结束时间窗(DUE_TIME)
%               - 第七列 : 服务时间(SERVICE_TIME)
%------------------------------------------------------------------------%

%       - 数据导入 - 
c101=importdata('c101.txt');
Size_instance = size(c101,1);                                           %       - 获取原始数据规模

%       - 输入生成需求 - 
Cus_size = 20;                                                                %       - 客户点数量   
Task_size = 20;                                                               %       - 任务点数量(必须大于客户点数量，为了方便计算，取客户点数量的1、1.5、2倍)
Task_inbound_size = 5;                                                    %       - 进口客户需求数量(先DF，后PE)
Task_outbound_size = Task_size - Task_inbound_size;     %       - 出口客户需求数量(先DE，后PF)
rand_rule = 0;                                                                   %       - 生成规则，取1时表示所有任务节点均匀分布给客户，取2时表示完全随机(但需要保证所有客户点有任务)  
p = 10;                                                                             %       - 装卸时间

%        - 创建空矩阵用于保存算例
Cus = zeros(Cus_size+3,2);                                              %      - 客户点矩阵。加3是因为要增加挂车中心、空箱堆场、重箱堆场位置 
Task = zeros(Task_size*2,5);                                              %      - 任务矩阵。  

%%%%%%%%%%%%%%%%%%
%               - Cus生成                   %
%%%%%%%%%%%%%%%%%%

%           (1) 抽取客户节点
Cus_select =  randperm(Size_instance - 1 ,Cus_size);

%           (2) 插入挂车中心坐标

Cus(1,1) = c101(1,2);
Cus(1,2) = c101(1,3);

%           (3)插入空箱堆场和重箱堆场坐标
%               - 这里先假设空箱堆场和重箱堆场都位于挂车中心

%   - 重箱堆场
Cus(2,1) = c101(1,2);
Cus(2,2) = c101(1,3);
%   - 空箱堆场
Cus(3,1) = c101(1,2);
Cus(3,2) = c101(1,3);

%           (4)插入被选择的客户节点
for i = 1:Cus_size
    Cus(i+3,1) = c101(Cus_select(i)+1,2);
    Cus(i+3,2) = c101(Cus_select(i)+1,3);
end

%%%%%%%%%%%%%%%%%%
%             - Task生成                   %
%%%%%%%%%%%%%%%%%%

%       -------(1)客户群体任务均匀时
if rand_rule ==1
%   - 生成所有任务对应客户点编号 ： Task_Cus

Task_Cus = [];          %       - 前Cus_size个任务对应的客户节点编号，保证每一个客户至少有一个任务         

cycle = ceil(Task_size/Cus_size);   %   Cus_select重复次数

for i=1:cycle
Task_Cus = [Task_Cus Cus_select ] ;              
end

Task_Cus = Task_Cus(1:Task_size);                     %       - 至此，所有任务对应的客户点完成            

else 
    
    Task_Cus = []; 
    Task_Cus = [Task_Cus Cus_select];%  把被选择客户插入进来，保证每个客户至少有一个任务
    
    for i =1:Task_size-Cus_size     %剩余客户插入任务
    se = randperm(Cus_size,1);
    Task_Cus = [Task_Cus Cus_select(se)];
    end
end



%   - 确定任务是inbound还是outbound

%   生成 Task_inbound_size 个 1 和Task_outbound_size 个0

Task_IO = [ones(Task_inbound_size,1);zeros(Task_outbound_size,1)];

Task_IO = Task_IO(randperm(length(Task_IO)));      %    - 至此，确定了每项任务的需求类型 

for i = 1:Task_size
        if Task_IO(i)==1   %   - 任务为进港任务时
            
            %   - 更新DF任务
            Task(2*i-1,1) = 2;                          %   - 起始点为重箱堆场  
            Task(2*i-1,2) = find(Task_Cus(i)==Cus_select);       %  - 终止点为客户节点
            Task(2*i-1,3) = 1;                      %   标记为DF任务
            Task(2*i-1,4) = 0;                      %   无前置任务
            Task(2*i-1,5) = p;                      %   有装卸时间
            
            %   - 更新PE任务
            Task(2*i,1) = find(Task_Cus(i)==Cus_select);          %   起点为客户点
            Task(2*i,2) = 3;                        %   终点为空箱堆场
            Task(2*i,3) = 2;                        %   标记为PE
            Task(2*i,4) = 2*i-1;                    %   前置任务为对应DF
            Task(2*i,5) = 0;                        %   无装卸时间
            
        else                 %  - 任务为出港任务时
            
           %   - 更新DE任务 
             Task(2*i-1,1) = 3;          %   起点为空箱堆场
            Task(2*i-1,2) = find(Task_Cus(i)==Cus_select);                        %   终点为空箱堆场
            Task(2*i-1,3) = 3;                        %   标记为PE
            Task(2*i-1,4) = 0;                    %   前置任务为对应DF
            Task(2*i-1,5) = 10;                        %   无装卸时间
            
            %   - 更新PF任务
            Task(2*i,1) = find(Task_Cus(i)==Cus_select);          %   起点为客户点
            Task(2*i,2) = 2;                        %   终点为空箱堆场
            Task(2*i,3) = 4;                        %   标记为PE
            Task(2*i,4) = 2*i-1;                    %   前置任务为对应DF
            Task(2*i,5) = 0;                        %   无装卸时间
            
        end
end












%----------------------------------------------------------------------------------------------------------------------------%%----------------------------------------------------------------------------------------------------------------------------%
%       -------(1)客户群体任务不均匀时




%Cus% 测试用
%Task%测试用




disp(['抽取的客户节点编号为']);
Cus_select
disp(['各任务对应的的客户节点编号为']);
Task_Cus
%------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------%
%   - 读取算例的横坐标(x)和纵坐标(y)




%----------------------------------------------------------------------------------------------------------------------------%
%   -- 输出ICT算例
%----------------------------------------------------------------------------------------------------------------------------%

% input = 输出算例规模(总任务个数)
%       -   总任务个数可以小于、等于、大于节点数量
%       -   任务类型分布 : DF、PE、DE、PF的占比(实际就是inbound和outbound任务数量)
%       -   任务产生节点 : (1)一个节点可以具有多项任务;(这种情况下任务数量必然低于节点数量)
%       -                (2)一个节点不可以具有多项任务。
%       -   任务装卸时间
%       -   前置任务情况
%       -   输入的是节点需求，输出的是P/D两个需求



%       - 算法设计
%       （1）随机选取若干个客户节点编号
%               (1-1)   算例中第一行的客户节点坐标必须获取
%               (1-2)   生成Cus

%       （2）给客户节点生成inbound或outbound任务
%         (3)  对于inbound客户，拆分成DF和PE两项任务
%       （4）对于outbound客户，拆分成DE和PF两项任务
%       （5）根据(3)和(4)，生成Task
%               （5-1） Task(:,5)的装卸时间，由VRPTW中的客户服务时间确定
%                 (5-2)    根据D和F，生成使直接确定出前置任务
%               （5-3） 如何确定最长服务时间？T_max  









